#+title: random

Just random stuff, to test out various fun features of this hacked together org-mode blogging system.

* code blocks
Here's some python:
#+begin_src python :results output
from datetime import datetime
print(datetime.now())
print('hello'*100)
#+end_src

#+RESULTS:
: 2021-07-15 12:33:26.814574
: hellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohellohello

And here's some elisp too:
#+begin_src emacs-lisp
(message "hi")
#+end_src

#+RESULTS:
: hi
* LaTeX
Here's some mathjax-rendered LaTeX:
$h(x) = \theta_0 + \theta_1x_1 + \theta_2x_2$
* Tippy
Ok so on hover, we want to:

1) fetch the page
2) set =data-tippy-content= on the ~<a>~ element to the fetched data
3) call ~tippy('[data-tippy-content]')~

[[file:20210717175142-life_map.org][Life Map]]

* Fibonacci squares

Random thought: I should write some python code to generate these squares.
游릲游릲游릲游릲游릲游릲游릲游릲游릴游릴游릴游릴游릴
游릲游릲游릲游릲游릲游릲游릲游릲游릴游릴游릴游릴游릴
游릲游릲游릲游릲游릲游릲游릲游릲游릴游릴游릴游릴游릴
游릲游릲游릲游릲游릲游릲游릲游릲游릴游릴游릴游릴游릴
游릲游릲游릲游릲游릲游릲游릲游릲游릴游릴游릴游릴游릴
游릲游릲游릲游릲游릲游릲游릲游릲游린游릳游릱游릱游릱
游릲游릲游릲游릲游릲游릲游릲游릲游릵游릵游릱游릱游릱
游릲游릲游릲游릲游릲游릲游릲游릲游릵游릵游릱游릱游릱

#+begin_src python :results output
import numpy as np

def fibonacci_squares_arr(n):
    if n < 0:
        raise Exception('nope.')
    if n == 0:
        return np.array([])
    if n == 1:
        return np.array([[n]])
    else:
        old = fibonacci_squares_arr(n - 1)
        side_len = max(old.shape)
        nxt = np.full((side_len, side_len), n)
        elems = (old, nxt) if n // 2 % 2 == 0 else (nxt, old)
        return np.concatenate(elems, axis=int(n % 2 == 0))

def fibonacci_squares(n):
    arr = fibonacci_squares_arr(n)
    chars = list('游린游릱游릲游릳游릴游릵游릶')
    fib_str = '\n'.join([''.join([chars[(elem - 1) % len(chars)]
                                  for elem in row]) for row in arr])
    return fib_str
print(fibonacci_squares(8))
#+end_src

#+RESULTS:
#+begin_example
游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游릶游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릵游릵游릵游릵游릵游릵游릵游릵游릲游릲游릳游릳游릳游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릵游릵游릵游릵游릵游릵游릵游릵游릲游릲游릳游릳游릳游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릵游릵游릵游릵游릵游릵游릵游릵游릱游린游릳游릳游릳游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릵游릵游릵游릵游릵游릵游릵游릵游릴游릴游릴游릴游릴游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릵游릵游릵游릵游릵游릵游릵游릵游릴游릴游릴游릴游릴游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릵游릵游릵游릵游릵游릵游릵游릵游릴游릴游릴游릴游릴游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릵游릵游릵游릵游릵游릵游릵游릵游릴游릴游릴游릴游릴游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
游릵游릵游릵游릵游릵游릵游릵游릵游릴游릴游릴游릴游릴游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린游린
#+end_example
